app/Controllers/Announcement.php

    public function index()
    {
        $data = [
            'announcements' => $this->announcementModel
                ->orderBy('created_at', 'DESC')
                ->findAll(),
        ];
---
SELECT *
FROM `announcements`
ORDER BY `created_at` DESC