app/Controllers/Auth.php

    public function login()
    {
        if ($this->request->getMethod() !== 'POST') {
            return view('auth/login');
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $this->userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'airaverola@gmail.com'
 LIMIT 1

public function dashboard()
{
    if (! session()->get('isLoggedIn')) {
        return redirect()->to(base_url('login'));
    }

    $session = session();
    $role = $session->get('role');
    $username = $session->get('username');
    $userId = $session->get('user_id');

    $courseModel = new \App\Models\CourseModel();
    $enrollmentModel = new \App\Models\EnrollmentModel();
    $materialModel = new \App\Models\MaterialModel();

    $data = [
        'username'         => $username,
        'role'             => $role,
        'availableCourses' => $courseModel->orderBy('course_name', 'ASC')->findAll(),
        'enrolledCourses'  => $enrollmentModel->getUserEnrollments($userId),
        'materials'        => [],
        'teacherCourses'   => [],
        'adminCourses'     => [], // ✅ Added for admin
    ];

    // ✅ Teachers and admins can see their uploaded materials
    if (in_array($role, ['teacher', 'admin'])) {
        $data['materials'] = $materialModel
            ->where('uploaded_by', $userId)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `courses`
ORDER BY `course_name` ASC
SELECT *
FROM `materials`
WHERE `uploaded_by` = '4'
ORDER BY `created_at` DESC

    if ($role === 'student') {
        $courseIds = array_column($data['enrolledCourses'], 'course_id');
        if (!empty($courseIds)) {
            $data['materials'] = $materialModel
                ->whereIn('course_id', $courseIds)
                ->orderBy('created_at', 'DESC')
                ->findAll();
---
SELECT *
FROM `materials`
WHERE `course_id` IN ('2','8','14','3','13','1')
ORDER BY `created_at` DESC


    // ✅ Teachers: Show all available courses
    if ($role === 'teacher') {
        $data['teacherCourses'] = $courseModel
            ->orderBy('course_name', 'ASC')
            ->findAll();
---
SELECT *
FROM `courses`
ORDER BY `course_name` ASC