app/Controllers/Course.php

SELECT *
FROM `courses`
WHERE `courses`.`id` = '4'
---
        }

        // ✅ Validate if the course exists
        $course = $this->courseModel->find($courseId);