app/Controllers/Course.php

SELECT *
FROM `enrollments`
WHERE `user_id` = '1'
AND `course_id` = '4'
 LIMIT 1
INSERT INTO `enrollments` (`user_id`, `course_id`) VALUES ('1', '4')
---
    public function enroll()
    {
        if (! $this->request->isAJAX() && $this->request->getMethod() !== 'post') {
            return $this->response->setStatusCode(400)->setJSON(['success' => false, 'message' => 'Invalid request']);
        }

        $userId = $this->session->get('user_id');
        $courseId = $this->request->getPost('course_id');

        // Check if already enrolled
        $exists = $this->enrollmentModel
            ->where('user_id', $userId)
            ->where('course_id', $courseId)
            ->first();

        if ($exists) {
            return $this->response->setJSON(['success' => false, 'message' => 'Already enrolled in this course.']);
        }

        // Insert enrollment
        $this->enrollmentModel->insert([
            'user_id' => $userId,
            'course_id' => $courseId,
        ]);