app/Controllers/Materials.php

    public function upload($courseId)
    {
        $session = session();

        // GET REQUEST → DISPLAY UPLOAD PAGE
        if ($this->request->getMethod() === 'GET') {

            $course = $this->courseModel->find($courseId);
            if (!$course) {
                throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Course not found');
            }

            $materials = $this->materialModel
                ->where('course_id', $courseId)
                ->orderBy('created_at', 'DESC')
                ->findAll();
---
SELECT *
FROM `courses`
WHERE `courses`.`id` = '8'
SELECT *
FROM `materials`
WHERE `course_id` = '8'
ORDER BY `created_at` DESC