app/Models/notificationmodel.php

SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = '2'
AND `is_read` = 0
---
    public function getUnreadCount($userId)
    {
        return $this->where('user_id', $userId)
                    ->where('is_read', 0)
                    ->countAllResults();

SELECT *
FROM `notifications`
WHERE `user_id` = '2'
ORDER BY `created_at` DESC
 LIMIT 10
---
    public function getNotificationsForUser($userId, $limit = 5)
    {
        return $this->where('user_id', $userId)
                    ->orderBy('created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();

UPDATE `notifications` SET `is_read` = 1
WHERE `notifications`.`id` IN ('4')
---
    public function markAsRead($notificationId)
    {
        return $this->update($notificationId, ['is_read' => 1]);